#Задание 1
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
#
# while start <= end:
#     print(start)
#     start += 1


#Задание 2
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
#
# while start <= end:
#     if start % 2 == 1:
#         print(start)
#     start += 1


#Задание 3
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
#
# while start <= end:
#     if start % 2 == 0:
#         print(start)
#     start += 1


#Задание 4
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
#
# # if end < start:
# while end != start:
#     print(end)
#     end -= 1


#Задание 5
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
#
# if end < start:
#     a = -end
#     b = -start
#     while b <= a:
#         if a % 2 == 1:
#             print(abs(a))
#         a -= 1
#
# else:
#     while start <= end:
#         if start % 2 == 1:
#             print(start)
#         start += 1





