#Задание 1
# start = int(input('Введите первое число: '))
# end = int(input('Введите второе число: '))
# a = 0
# devisor = (end - start) + 1
#
# while start <= end:
#     a = a + start
#     start += 1
# print(f"Сумма чисаел = {a}")
# print(f"Среднеарифметическое = { a/ devisor }")



#Задание 2
# start = 1
# end = int(input('Введите число: '))
# factorial = 1
#
# while start <= end:
#     factorial = factorial * start
#     start += 1
# print(factorial)


#Задание 3
# start = 1
# len = int(input('Введите длину линии: '))
#
# while start <= len:
#     print('*', end = '')
#     start += 1


# Задание 4
# len = int(input('Введите длину линии: '))
# sym = input('Введите символ для заполнения: ')
# start = 1
#
# while start <= len:
#     print( sym, end = '')
#     start += 1

