const Attractions = () => {
  return (
    <div className="w-10/12 h-screen shadow p-5 flex flex-col gap-5">
      <div className="flex gap-5">
        <img
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Baku_Maiden_Tower_004_7736.jpg/260px-Baku_Maiden_Tower_004_7736.jpg"
          alt=""
        />
        <p>
          Девичья башня (азерб. Qız Qalası [Гыз галасы́]) — древняя крепостная
          постройка у прибрежной части Ичери-шехер («Внутреннего города»).
          Является одним из важнейших компонентов приморского «фасада» Баку:
          возвышается в прибрежной части феодального города — Крепости. Башня
          стоит на скале, частично облицованной чисто тёсаным камнем и
          защищённой крепостной стеной с системой крупных полукруглых выступов,
          поднимающихся от подножия почти до самой вершины. Её высота составляет
          28 метров над уровнем моря. Башня занесена в ЮНЕСКО и является одним
          из важнейших архитектурных наследий Азербайджана.
        </p>
      </div>
      <div className="flex gap-5">
        <p>
          Ичери́-шехе́р (азерб. İçərişəhər «Внутренний город») или «старый» город,
          простореч. Крепость (азерб. Qala) — старинный жилой квартал —
          историко-архитектурный заповедник в столице Азербайджана городе Баку.
          Окружённый хорошо сохранившимися крепостными стенами, является
          наиболее древней частью и достопримечательностью города. На площади в
          221 тыс. м², который занимает заповедник, проживает более 1300 семей
        </p>
        <img
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/%C4%B0%C3%A7%C9%99ri%C5%9F%C9%99h%C9%99r_kollaj%C4%B1.jpg/320px-%C4%B0%C3%A7%C9%99ri%C5%9F%C9%99h%C9%99r_kollaj%C4%B1.jpg"
          alt=""
        />
      </div>
    </div>
  );
};

export default Attractions;
