const Info = () => {
  return (
    <div className="w-10/12 shadow p-5 flex flex-col gap-5">
      <img
        src="https://blog-cdn.aviata.kz/posts/thumbnails/0_011ebe663584bb0bf39cf77f3f5ddf2bc5daa925.webp"
        alt="city-img"
      />
      <p>
        Баку́ (азерб. Bakı, МФА (азерб.): [bɑˈcɯ]) — столица Азербайджанской
        Республики, крупнейший промышленный, экономический и научно-технический
        центр Закавказья, а также самый крупный порт на Каспийском море и самый
        большой город на Кавказе. До июля 2021 года территория города Баку
        входила в Абшеронский экономический район, а иногда числилась отдельно.
        По указу президента Азербайджана от 7 июля 2021 года «О новом разделении
        экономических районов в Азербайджанской Республике», был создан
        Бакинский экономический район, куда и входит город Баку. Первое
        упоминание о городе относится к V веку, является одним из древнейших
        городов мира. Площадь территории, которая административно управляется
        Баку, составляет 2140 км². Население этой территории — 2 262,6 тысячи
        жителей (на 1 января 2018 года); на ней располагаются собственно город
        Баку с населением 1 259,3 тыс. жителей и 59 посёлков городского типа с
        суммарным населением 1 003,3 тыс. жителей. Баку расположен на южном
        берегу Апшеронского полуострова. Город по своей древности, величине
        территории и численности населения является одним из старинных и
        крупнейших городов Востока. Население всего Апшеронского полуострова
        (Бакинской агломерации) составляет 2 813,8 тыс. жителей. В 2010 году
        Баку был удостоен Программой ООН по окружающей среде (UNEP) звания
        одного из главных городов по проведению Всемирного дня окружающей среды,
        наряду с Генуей (Италия) и Женевой (Швейцария)
      </p>
    </div>
  );
};

export default Info;
